우리는 지금 아나콘다를 쓰고있다.
아나콘다에 설치되어있는 파이썬을 쓰고있다.

- 판다스
1. Object Creation (객체 생성)
2. Viewing Data (데이터 확인하기)
3. Selection (선택)
4. Missing Data (결측치)
5. Operation (연산)
6. Merge (병합)
7. Grouping (그룹화)
8. Reshaping (변형)
9. Time Series (시계열)
10. Categoricals (범주화)
11. Plotting (그래프)
12. Getting Data In / Out (데이터 입 / 출력)
13. Gotchas (잡았다!)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## 1. Object Creation (객체 생성)

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Pandas는 값을 가지고 있는 리스트를 통해 Series를 만들고, 정수로 만들어진 인덱스를 기본값으로 불러올 것입니다.

Series 란?
Pandas는 데이터를 다루기 위한 파이썬 라이브러리입니다. Pandas Series는 Pandas에서 제공하는 데이터 구조 중 하나로, 1차원 배열 형태의 데이터를 다룰 때 사용됩니다. Series는 인덱스와 값으로 이루어져 있으며, 인덱스는 기본값으로 정수형 인덱스가 사용됩니다

In [4]:
my_list = [1, 2, 3] # 리스트
my_series = pd.Series(my_list) #리스트를 pd.Series로 변환
print(my_series)

0    1
1    2
2    3
dtype: int64

In [5]:
dates = pd.date_range('20130101', periods = 6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
list('ABCD')

['A', 'B', 'C', 'D']

In [8]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [9]:
df

                   A         B         C         D
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968
2013-01-03  0.406152 -1.750393  0.452700  2.498560
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-05 -0.162644  0.892175  0.955318 -0.347630
2013-01-06 -0.288975  1.436350  0.339855 -0.102612

In [10]:
pd.Timestamp('20130102')

Timestamp('2013-01-02 00:00:00')

In [11]:
pd.Series(1,index=list(range(4)),dtype='float32')

0    1.0
1    1.0
2    1.0
3    1.0
dtype: float32

In [12]:
index=list(range(4))
print(index)

[0, 1, 2, 3]

In [13]:
np.array([3] * 4,dtype='int32')

array([3, 3, 3, 3])

In [14]:
pd.Categorical(["test","train","test","train"])

['test', 'train', 'test', 'train']
Categories (2, object): ['test', 'train']

In [15]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [16]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [17]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [105]:
type(df2)

pandas.core.frame.DataFrame

DataFrame 틀
변수.
객체를 만들어서 쓴다.

## 2. Viewing Data (데이터 확인하기)

In [19]:
df

                   A         B         C         D
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968
2013-01-03  0.406152 -1.750393  0.452700  2.498560
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-05 -0.162644  0.892175  0.955318 -0.347630
2013-01-06 -0.288975  1.436350  0.339855 -0.102612

In [20]:
df.head()

                   A         B         C         D
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968
2013-01-03  0.406152 -1.750393  0.452700  2.498560
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-05 -0.162644  0.892175  0.955318 -0.347630

In [21]:
df.tail()

                   A         B         C         D
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968
2013-01-03  0.406152 -1.750393  0.452700  2.498560
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-05 -0.162644  0.892175  0.955318 -0.347630
2013-01-06 -0.288975  1.436350  0.339855 -0.102612

In [22]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-05 -0.162644  0.892175  0.955318 -0.347630
2013-01-06 -0.288975  1.436350  0.339855 -0.102612

In [23]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [24]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [25]:
df.values

array([[ 1.51352762, -2.57241555, -1.43197615, -0.72117278],
       [-1.17908611,  0.21322426, -0.53758443, -0.16896774],
       [ 0.40615172, -1.75039348,  0.45269984,  2.49855964],
       [ 1.57683462, -0.55768376,  0.85709532, -0.17113258],
       [-0.16264413,  0.89217532,  0.95531834, -0.34763047],
       [-0.28897545,  1.43635046,  0.33985537, -0.10261247]])

In [26]:
#리스트를 여러개 묶은 것을 array라고 함

In [27]:
df.describe()
#기술통계량 정보를 보여준다

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.310968 -0.389790  0.105901  0.164507
std    1.082786  1.548233  0.920863  1.165309
min   -1.179086 -2.572416 -1.431976 -0.721173
25%   -0.257393 -1.452216 -0.318224 -0.303506
50%    0.121754 -0.172230  0.396278 -0.170050
75%    1.236684  0.722438  0.755996 -0.119201
max    1.576835  1.436350  0.955318  2.498560

In [28]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [29]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [30]:
# .describe()는 숫자형 데이터에 기본적으로 적용된다.
# 기술통계량의 정보를 보여준다

In [31]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.513528   -1.179086    0.406152    1.576835   -0.162644   -0.288975
B   -2.572416    0.213224   -1.750393   -0.557684    0.892175    1.436350
C   -1.431976   -0.537584    0.452700    0.857095    0.955318    0.339855
D   -0.721173   -0.168968    2.498560   -0.171133   -0.347630   -0.102612

In [32]:
df

                   A         B         C         D
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968
2013-01-03  0.406152 -1.750393  0.452700  2.498560
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-05 -0.162644  0.892175  0.955318 -0.347630
2013-01-06 -0.288975  1.436350  0.339855 -0.102612

In [33]:
df.sort_index(axis=0, ascending=True)
#인덱스를 정렬해준다
#axis = 0 이면 행을 정렬해준다
#axis = 1 이면 열을 정렬해준다
#accending = True -> 오름차순으로 정렬해준다
#accending = False -> 내림차순으로 정렬해준다

                   A         B         C         D
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968
2013-01-03  0.406152 -1.750393  0.452700  2.498560
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-05 -0.162644  0.892175  0.955318 -0.347630
2013-01-06 -0.288975  1.436350  0.339855 -0.102612

In [34]:
df.sort_values(by='C')

                   A         B         C         D
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968
2013-01-06 -0.288975  1.436350  0.339855 -0.102612
2013-01-03  0.406152 -1.750393  0.452700  2.498560
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-05 -0.162644  0.892175  0.955318 -0.347630

- by: 정렬할 열(column)의 이름이나 이름의 리스트입니다.
- axis: 정렬할 축(axis)입니다. 0이면 행(row), 1이면 열(column)을 기준으로 정렬합니다.
- ascending: 오름차순으로 정렬할지 여부입니다. True이면 오름차순으로 정렬하고, False이면 내림차순으로 정렬합니다.
-inplace: 정렬한 결과를 원본 데이터프레임을 변경할지 여부입니다. True이면 원본 데이터프레임을 변경하고, False이면 새로운 데이터프레임을 반환합니다.
- kind: 정렬 알고리즘의 종류입니다. 기본값은 'quicksort’입니다.
na_position: 결측값(NaN)이 있는 경우 어디에 위치시킬지를 나타냅니다. 'last’이면 마지막에 위치시키고, 'first’이면 처음에 위치시킵니다.
- ignore_index: 인덱스를 재설정할지 여부입니다. True이면 인덱스를 재설정하고, False이면 원래 인덱스를 유지합니다.
- key: 정렬 기준을 지정하는 함수(function)입니다.

In [35]:
# 데이터프레임을 B 열을 기준으로 내림차순 정렬하되, 결측값을 마지막에 위치시키고, 
# 정렬한 결과를 원래 데이터프레임에 적용하는 경우 다음과 같이 정렬됩니다.
df.sort_values('B', ascending=False, na_position='last', inplace=True)
df

                   A         B         C         D
2013-01-06 -0.288975  1.436350  0.339855 -0.102612
2013-01-05 -0.162644  0.892175  0.955318 -0.347630
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-03  0.406152 -1.750393  0.452700  2.498560
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173

In [36]:
df.tail()

                   A         B         C         D
2013-01-05 -0.162644  0.892175  0.955318 -0.347630
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-03  0.406152 -1.750393  0.452700  2.498560
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173

df.head()  
df.tail()  
df.index  
df.columns  
df.values  
df.describe()  
df.T  
df.sort_index(axis=1, ascending=False)  
df.sort_values(by='B')

## 3. Selection (선택)
선택과 설정을 위한 Python / Numpy의 표준화된 표현들이 직관적이며, 코드 작성을 위한 양방향 작업에 유용하지만, 우리는 Pandas에 최적화된 데이터 접근 방법인 loc 및 .iloc 을 추천합니다.

In [37]:
df

                   A         B         C         D
2013-01-06 -0.288975  1.436350  0.339855 -0.102612
2013-01-05 -0.162644  0.892175  0.955318 -0.347630
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-03  0.406152 -1.750393  0.452700  2.498560
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173

### Getting (데이터 얻기)

In [38]:
# df.A 와 동일한 Series를 생성하는 단일 열을 선택합니다.
df['A']

2013-01-06   -0.288975
2013-01-05   -0.162644
2013-01-02   -1.179086
2013-01-04    1.576835
2013-01-03    0.406152
2013-01-01    1.513528
Name: A, dtype: float64

In [39]:
# 행을 분할하는 [ ]를 통해 선택합니다.
df[0:3]

                   A         B         C         D
2013-01-06 -0.288975  1.436350  0.339855 -0.102612
2013-01-05 -0.162644  0.892175  0.955318 -0.347630
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968

In [40]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-03  0.406152 -1.750393  0.452700  2.498560

### Selection by Label (Label을 통한 선택)

In [41]:
# 라벨을 사용하여 횡단면을 얻습니다.
df.loc[dates[0]]

A    1.513528
B   -2.572416
C   -1.431976
D   -0.721173
Name: 2013-01-01 00:00:00, dtype: float64

In [42]:
# 라벨을 사용하여 여러 축 (의 데이터)을 얻습니다.
df.loc[:,['A','B']]

                   A         B
2013-01-06 -0.288975  1.436350
2013-01-05 -0.162644  0.892175
2013-01-02 -1.179086  0.213224
2013-01-04  1.576835 -0.557684
2013-01-03  0.406152 -1.750393
2013-01-01  1.513528 -2.572416

In [43]:
df.loc[dates[0],['A','B']]

A    1.513528
B   -2.572416
Name: 2013-01-01 00:00:00, dtype: float64

In [44]:
df.loc['20130102':'20130104', ['A','B']]

                   A         B
2013-01-02 -1.179086  0.213224
2013-01-04  1.576835 -0.557684
2013-01-03  0.406152 -1.750393

In [45]:
df.loc['20130102',['A','B']]

                   A         B
2013-01-02 -1.179086  0.213224

In [46]:
# 스칼라 값을 얻습니다.
# 스칼라 : 값 하나
df.loc[dates[0],'A']

1.5135276238740607

### Selection by Position (위치로 선택하기)

In [47]:
df

                   A         B         C         D
2013-01-06 -0.288975  1.436350  0.339855 -0.102612
2013-01-05 -0.162644  0.892175  0.955318 -0.347630
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-03  0.406152 -1.750393  0.452700  2.498560
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173

In [48]:
# iloc 의 i 는 index의 약자이다.
df.iloc[3]

A    1.576835
B   -0.557684
C    0.857095
D   -0.171133
Name: 2013-01-04 00:00:00, dtype: float64

In [49]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.576835 -0.557684
2013-01-03  0.406152 -1.750393

In [50]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-05 -0.162644  0.892175  0.955318 -0.347630
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968

In [51]:
df.iloc[:,1:3]

                   B         C
2013-01-06  1.436350  0.339855
2013-01-05  0.892175  0.955318
2013-01-02  0.213224 -0.537584
2013-01-04 -0.557684  0.857095
2013-01-03 -1.750393  0.452700
2013-01-01 -2.572416 -1.431976

In [52]:
df.iloc[1,1]

0.8921753174896488

### Boolean Indexing
조건에 맞는 값을 필터하겠다.

In [53]:
df

                   A         B         C         D
2013-01-06 -0.288975  1.436350  0.339855 -0.102612
2013-01-05 -0.162644  0.892175  0.955318 -0.347630
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-03  0.406152 -1.750393  0.452700  2.498560
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173

In [54]:
# 컬럼명 쓸 때 가급적 이렇게 쓰지말자
df[df.A > 0]

                   A         B         C         D
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-03  0.406152 -1.750393  0.452700  2.498560
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173

In [55]:
# 컬럼명 쓸 때 가급적 이렇게 쓰자.
df[df['A'] > 0]

                   A         B         C         D
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-03  0.406152 -1.750393  0.452700  2.498560
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173

In [56]:
df[df > 0]

                   A         B         C        D
2013-01-06       NaN  1.436350  0.339855      NaN
2013-01-05       NaN  0.892175  0.955318      NaN
2013-01-02       NaN  0.213224       NaN      NaN
2013-01-04  1.576835       NaN  0.857095      NaN
2013-01-03  0.406152       NaN  0.452700  2.49856
2013-01-01  1.513528       NaN       NaN      NaN

In [57]:
df1 = df

In [58]:
df1

                   A         B         C         D
2013-01-06 -0.288975  1.436350  0.339855 -0.102612
2013-01-05 -0.162644  0.892175  0.955318 -0.347630
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968
2013-01-04  1.576835 -0.557684  0.857095 -0.171133
2013-01-03  0.406152 -1.750393  0.452700  2.498560
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173

In [59]:
df1['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [60]:
df1

                   A         B         C         D      E
2013-01-06 -0.288975  1.436350  0.339855 -0.102612    one
2013-01-05 -0.162644  0.892175  0.955318 -0.347630    one
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968    two
2013-01-04  1.576835 -0.557684  0.857095 -0.171133  three
2013-01-03  0.406152 -1.750393  0.452700  2.498560   four
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173  three

In [61]:
# 필터링을 위한 메소드 isin()을 사용합니다.
df1[df1['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968   two
2013-01-03  0.406152 -1.750393  0.452700  2.498560  four

### Setting (설정)
새 열을 설정하면 데이터가 인덱스 별로 자동 정렬됩니다.

In [62]:
df

                   A         B         C         D      E
2013-01-06 -0.288975  1.436350  0.339855 -0.102612    one
2013-01-05 -0.162644  0.892175  0.955318 -0.347630    one
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968    two
2013-01-04  1.576835 -0.557684  0.857095 -0.171133  three
2013-01-03  0.406152 -1.750393  0.452700  2.498560   four
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173  three

In [63]:
s1 = pd.Series([1,2,3,4,5,6], index = pd.date_range('20130102', periods=6))

In [64]:
df['F'] = s1

In [65]:
df

                   A         B         C         D      E    F
2013-01-06 -0.288975  1.436350  0.339855 -0.102612    one  5.0
2013-01-05 -0.162644  0.892175  0.955318 -0.347630    one  4.0
2013-01-02 -1.179086  0.213224 -0.537584 -0.168968    two  1.0
2013-01-04  1.576835 -0.557684  0.857095 -0.171133  three  3.0
2013-01-03  0.406152 -1.750393  0.452700  2.498560   four  2.0
2013-01-01  1.513528 -2.572416 -1.431976 -0.721173  three  NaN

In [66]:
index = pd.date_range('20130102', periods=6)
index

DatetimeIndex(['2013-01-02', '2013-01-03', '2013-01-04', '2013-01-05',
               '2013-01-06', '2013-01-07'],
              dtype='datetime64[ns]', freq='D')

pd.date_range('20130102', periods=6)은 Pandas에서 제공하는 날짜 범위 생성 함수입니다. 이 함수는 시작일과 종료일, 또는 시작일과 기간을 지정하여 해당 기간 동안의 날짜 범위를 생성합니다.

In [67]:
len(df)

6

In [68]:
[5]*len(df)

[5, 5, 5, 5, 5, 5]

In [69]:
np.array([5] * len(df))

array([5, 5, 5, 5, 5, 5])

In [70]:
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D      E    F
2013-01-06 -0.288975  1.436350  0.339855  5    one  5.0
2013-01-05 -0.162644  0.892175  0.955318  5    one  4.0
2013-01-02 -1.179086  0.213224 -0.537584  5    two  1.0
2013-01-04  1.576835 -0.557684  0.857095  5  three  3.0
2013-01-03  0.406152 -1.750393  0.452700  5   four  2.0
2013-01-01  1.513528 -2.572416 -1.431976  5  three  NaN

NumPy의 ndarray 객체는 다차원 배열을 다루기 위한 클래스입니다. ndarray는 N-dimensional array의 약자로, 1차원 배열인 vector부터 다차원 배열인 tensor까지 다양한 형태의 배열을 다룰 수 있습니다.

1차원 배열을 생성
arr = np.array([1, 2, 3, 4, 5])

2차원 배열을 생성
arr = np.array([[1, 2], [3, 4], [5, 6]])

In [71]:
df.loc[:,'D'] = [5] * len(df)
df

                   A         B         C  D      E    F
2013-01-06 -0.288975  1.436350  0.339855  5    one  5.0
2013-01-05 -0.162644  0.892175  0.955318  5    one  4.0
2013-01-02 -1.179086  0.213224 -0.537584  5    two  1.0
2013-01-04  1.576835 -0.557684  0.857095  5  three  3.0
2013-01-03  0.406152 -1.750393  0.452700  5   four  2.0
2013-01-01  1.513528 -2.572416 -1.431976  5  three  NaN

In [72]:
df2 = df.copy()
df2

                   A         B         C  D      E    F
2013-01-06 -0.288975  1.436350  0.339855  5    one  5.0
2013-01-05 -0.162644  0.892175  0.955318  5    one  4.0
2013-01-02 -1.179086  0.213224 -0.537584  5    two  1.0
2013-01-04  1.576835 -0.557684  0.857095  5  three  3.0
2013-01-03  0.406152 -1.750393  0.452700  5   four  2.0
2013-01-01  1.513528 -2.572416 -1.431976  5  three  NaN

In [73]:
df2 = df2.describe()

In [74]:
df2[df2 > 0] = -df2
df2

              A         B         C    D         F
count -6.000000 -6.000000 -6.000000 -6.0 -5.000000
mean  -0.310968 -0.389790 -0.105901 -5.0 -3.000000
std   -1.082786 -1.548233 -0.920863  0.0 -1.581139
min   -1.179086 -2.572416 -1.431976 -5.0 -1.000000
25%   -0.257393 -1.452216 -0.318224 -5.0 -2.000000
50%   -0.121754 -0.172230 -0.396278 -5.0 -3.000000
75%   -1.236684 -0.722438 -0.755996 -5.0 -4.000000
max   -1.576835 -1.436350 -0.955318 -5.0 -5.000000

- 여기까지 한 내용 정리
1. Object Creation (객체 생성)
2. Viewing Data (데이터 확인하기)
3. Selection (선택)

## 4. Missing Data (결측치)
Pandas는 결측치를 표현하기 위해 주로 np.nan 값을 사용합니다.

Reindexing으로 지정된 축 상의 인덱스를 변경 / 추가 / 삭제할 수 있습니다. Reindexing은 데이터의 복사본을 반환합니다.

In [85]:
df

                   A         B         C  D    F
2013-01-06 -0.288975  1.436350  0.339855  5  5.0
2013-01-05 -0.162644  0.892175  0.955318  5  4.0
2013-01-02 -1.179086  0.213224 -0.537584  5  1.0
2013-01-04  1.576835 -0.557684  0.857095  5  3.0
2013-01-03  0.406152 -1.750393  0.452700  5  2.0
2013-01-01  1.513528 -2.572416 -1.431976  5  NaN

## 5. Operation (연산)

### Stats (통계)
일반적으로 결측치를 제외한 후 연산됩니다.

In [96]:
# 열별 평균값 계산
df.mean()

A    0.310968
B   -0.389790
C    0.105901
D    5.000000
F    3.000000
dtype: float64

In [99]:
# mean(1) 괄호 안에 1은 행을 의미한다.
df.mean(1)

2013-01-06    2.297446
2013-01-05    2.136970
2013-01-02    0.899311
2013-01-04    1.975249
2013-01-03    1.221692
2013-01-01    0.627284
dtype: float64

In [104]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [103]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

### Apply (적용)

In [87]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-06 -0.288975  1.436350  0.339855   5   5.0
2013-01-05 -0.451620  2.328526  1.295174  10   9.0
2013-01-02 -1.630706  2.541750  0.757589  15  10.0
2013-01-04 -0.053871  1.984066  1.614685  20  13.0
2013-01-03  0.352281  0.233673  2.067384  25  15.0
2013-01-01  1.865808 -2.338743  0.635408  30   NaN

In [95]:
df.apply(lambda x: x.max() - x.min())

A    2.755921
B    4.008766
C    2.387294
D    0.000000
F    4.000000
dtype: float64

## Histogramming (히스토그래밍)

In [90]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    3
1    5
2    0
3    1
4    6
5    6
6    1
7    4
8    4
9    6
dtype: int32

In [91]:
s.value_counts()

6    3
1    2
4    2
3    1
5    1
0    1
dtype: int64

## String Methods (문자열 메소드)
Series는 다음의 코드와 같이 문자열 처리 메소드 모음 (set)을 가지고 있습니다.
이 모음은 배열의 각 요소를 쉽게 조작할 수 있도록 만들어주는 문자열의 속성에 포함되어 있습니다.

문자열의 패턴 일치 확인은 기본적으로 정규 표현식을 사용하며, 몇몇 경우에는 항상 정규 표현식을 사용함에 유의하십시오.

In [92]:
s = pd.Series(['A','B','C','Aaba','Baca',np.nan,'CABA','dog','cat'])

In [93]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object